# Homework Assignment 3

In [1]:
import numpy as np
import pandas as pd

### Question 1

The `fifa.csv` data contains a variety of information on nearly 9,000 soccer players. Load the data and assign it to the variable `df`. Then collect summary statistics from all columns using the `.describe()` method.

In [2]:
df = pd.read_csv("fifa.csv")
df.describe()

,id,rating,height,rare,pace,shooting,passing,dribbling,defending,heading,diving,handling,kicking,reflexes,speed,positioning
count,8847.000000,8847.000000,8847.000000,8847.000000,7917.000000,7917.000000,7917.000000,7917.000000,7917.000000,7917.000000,930.000000,930.000000,930.000000,930.000000,930.000000,930.000000
mean,152337.538035,66.680457,181.750424,0.353114,67.934066,55.054440,58.845522,61.193887,60.339523,63.743337,67.351613,64.739785,63.067742,68.865591,48.212903,64.955914
std,54506.606056,7.146679,6.454356,0.477965,11.169316,13.136116,10.962049,12.255261,10.622997,8.982680,8.311224,8.073867,8.653150,8.546599,10.330171,8.854231
min,2.000000,40.000000,158.000000,0.000000,24.000000,12.000000,13.000000,19.000000,26.000000,22.000000,30.000000,39.000000,30.000000,32.000000,14.000000,37.000000
25%,140001.500000,62.000000,178.000000,0.000000,62.000000,47.000000,52.000000,54.000000,52.000000,58.000000,62.000000,60.000000,57.000000,63.000000,42.000000,59.000000
50%,171578.000000,66.000000,182.000000,0.000000,69.000000,57.000000,60.000000,63.000000,61.000000,64.000000,67.000000,65.000000,63.000000,69.000000,50.000000,65.000000
75%,189185.000000,72.000000,186.000000,1.000000,75.000000,65.000000,66.000000,70.000000,68.000000,70.000000,73.000000,70.000000,69.000000,74.000000,56.000000,71.000000
max,205583.000000,94.000000,208.000000,1.000000,96.000000,90.000000,92.000000,97.000000,89.000000,91.000000,91.000000,86.000000,94.000000,93.000000,73.000000,91.000000

### Question 2

Find the player (or players) in the data set with the longest `name`. Use a list comprehension to create a new list to hold the lengths of each name, sort the list, then slice the DataFrame to find all values where `name` has the same length as the largest value. (**Note:** recall that lists use zero indexing, so `[0]` will access the first element in a list and `[-1]` will access the last element in the list.)

In [109]:
name_len = [len(x) for x in df["name"]]
name_len.sort()
df.loc[df["name"].str.len() == name_len[-1]]

,id,name,rating,position,height,foot,rare,pace,shooting,passing,dribbling,defending,heading,diving,handling,kicking,reflexes,speed,positioning,name_len
4187,178386,Cesare Gianf. Rickler Del Mare,65,D,196,Right,1,53.0,33.0,43.0,35.0,71.0,69.0,NaN,NaN,NaN,NaN,NaN,NaN,30

### Question 3

Use `groupby` to group the `rating` variable by the player's `position`. Which `position` has the highest mean `rating`? Remember to chain `.sort_values(ascending=False)` to sort the resulting data on their values and not alphabetically by position name.

In [49]:
grouped = df["rating"].groupby(df["position"])
grouped.mean().sort_values(ascending = False)

position
A     67.260807
M     67.087142
D     66.059055
GK    65.918280
Name: rating, dtype: float64

In [90]:
print("Highest mean rating: ", grouped.mean().max())
print("\nPosition A has the highest mean rating.")

Highest mean rating:  67.26080691642652

Position A has the highest mean rating.

### Question 4

Create a Pandas `pivot_table` to count the number of players in each `position`. Use `rating` as the aggregation value again, but this time pass `aggfunc='count'` to report the number of players. Which `position` has the most players? Remember to sort the values in descending order, and include `by='rating'` to sort on the counted data.

In [5]:
Temp = pd.pivot_table(data=df, values='rating', index='position', aggfunc='count', margins=True)
Temp.sort_values(by='rating', ascending=False)

          rating
position
All         8847
M           3041
D           2794
A           2082
GK           930

In [91]:
print("Postion M has most players")

Postion M has most players

### Question 5

Create a Pandas `crosstab` to compare the number of players in each `position` by `foot`. Set `normalize='all'` and `margins=True` to view the data as a percent of the total. What combination of footedness and position is the most rare in our data?

In [64]:
pd.crosstab(df["position"], df["foot"], margins = True, normalize = 'all')

foot          Left     Right       All
position
A         0.041596  0.193738  0.235334
D         0.103425  0.212388  0.315813
GK        0.011077  0.094043  0.105120
M         0.079575  0.264157  0.343732
All       0.235673  0.764327  1.000000

In [66]:
print("Combination of {} and {} is the most rare in the data".format("Left","GK"))

Combination of Left and GK is the most rare in the data

### Question 6

Now we will look at some Major League Soccer (MLS) data in the U.S. Load the `'mls_salaries17.csv'` file and aggregate the data by `position` to count how many players in the MLS play at each position. Remember to sort the values from largest to smallest. Is the same position in Question 4 the largest in the MLS too?

In [106]:
MLS_data = pd.read_csv("mls_salaries17.csv")

MLS_Pivot = MLS_data.groupby("position").count()

MLS_Pivot["id"].sort_values(ascending=False)

position
M     236
D     199
A     116
GK     65
Name: id, dtype: int64

### Question 7

Group the MLS `base_salary` data by `club` to find the club with the highest average (`mean`) salary. Group the MLS salary data again to find the club with the highest `max` salary. Is there a difference between the two? Remember to sort the values from largest to smallest.

In [32]:
MLS_Sal_Grp = MLS_data["base_salary"].groupby(MLS_data["club"])
Average_Salary = MLS_Sal_Grp.mean().sort_values(ascending=False)
Average_Salary

club
Toronto FC                718893.642857
New York City FC          620375.917143
Chicago Fire              454541.629630
Orlando City              412969.477419
Seattle Sounders FC       359468.115600
Portland Timbers          344241.927407
LA Galaxy                 343161.194483
Colorado Rapids           279028.798077
Atlanta United FC         259213.420645
Real Salt Lake            253942.238519
Sporting Kansas City      239378.769231
New England Revolution    235086.663043
New York Red Bulls        225499.357143
San Jose Earthquakes      221709.172414
Vancouver Whitecaps       220011.440000
Columbus Crew             211507.749333
Philadelphia Union        210221.806452
FC Dallas                 206571.699310
Montreal Impact           187950.780741
Minnesota United          182446.149630
DC United                 178227.238519
Houston Dynamo            175144.642143
Name: base_salary, dtype: float64

In [142]:
print("Club with the highest average (mean) salary is {Name} and the average salary is {Salary}".format(Name = "Toronto FC", Salary = round(Average_Salary.max(),2)))

Club with the highest average (mean) salary is Toronto FC and the average salary is 718893.64

In [34]:
Maximum_Salary = MLS_Sal_Grp.max().sort_values(ascending=False)
Maximum_Salary

club
Orlando City              6660000.00
Toronto FC                6000000.00
New York City FC          5610000.00
Chicago Fire              5400000.00
LA Galaxy                 3750000.00
Seattle Sounders FC       3200000.00
Portland Timbers          2227500.00
Colorado Rapids           2000000.00
Atlanta United FC         1912500.00
Real Salt Lake            1750000.00
New York Red Bulls        1500000.00
Vancouver Whitecaps       1400000.04
Philadelphia Union        1131000.00
Columbus Crew             1050000.00
Sporting Kansas City       850000.00
New England Revolution     840000.00
San Jose Earthquakes       800000.00
FC Dallas                  784000.00
Montreal Impact            700000.08
Houston Dynamo             650000.00
Minnesota United           550008.00
DC United                  500000.00
Name: base_salary, dtype: float64

In [143]:
print("Club with the highest max salary is {Name} and the average salary is {Salary}".format(Name = "Orlando City", Salary = round(Maximum_Salary.max(),2)))

print("\nYes, there is a difference between the club with the highest average salary and the club with the highest max salary")

Club with the highest max salary is Orlando City and the average salary is 6660000.0

Yes, there is a difference between the club with the highest average salary and the club with the highest max salary

### Question 8

Use Pandas indexing to find the row with the highest-paid player using `base_salary`. How far above the average salary is his `base_salary`?

In [145]:
MLS_data[["id","club","last_name","first_name","base_salary"]][MLS_data["base_salary"] == MLS_data["base_salary"].max()]

      id          club last_name first_name  base_salary
401  ORL  Orlando City      Kaka        NaN    6660000.0

In [146]:
print("Distance from the average salary: ", round(MLS_data["base_salary"].max() - MLS_data["base_salary"].mean(),2))

Distance from the average salary:  6363022.26

### Question 9

Load the MLS team rankings data from `'mls_rankings17.csv'`. Print the `shape` of this data set and of the `'mls_salary17.csv'`. Merge the two DataFrames together on `id` and `club` and print the `shape` of the resulting dataframe. The number of columns from the merged DataFrame should be two less than the sum of the columns of both to account for the merge keys that are the same in both.

In [40]:
MLS_Ranking = pd.read_csv('mls_rankings17.csv')
MLS_Ranking.shape

(22, 11)

In [39]:
MLS_data.shape

(616, 7)

In [67]:
Merged_Dataset = pd.merge(MLS_Ranking, MLS_data, on = ["id","club"])
Merged_Dataset.shape

(616, 16)

### Question 10

Use `np.where()` to add an indicator variable identifying teams in the top 10 (where `ranking` is greater than or equal to 10.) Call this new variable `top10`. Create a pivot table using the combined MLS data. Use `'top10'` as the index value, `position` as the column value, and `base_salary` to fill the table. Aggregate using the `mean`. Do the higher-performing clubs tend to pay their players more or less than the lower-performing clubs?

In [147]:
Condition = Merged_Dataset['ranking']

top_10_teams = np.where(Condition <= 10, "Top 10 Teams", "Under Top 10 Teams")

Merged_Dataset_Pivot = pd.pivot_table(data = Merged_Dataset, values ="base_salary", index = top_10_teams, columns = "position", aggfunc = "mean")
Merged_Dataset_Pivot

position                        A              D             GK              M
Top 10 Teams        698952.711600  164459.559565  117117.458621  417861.343628
Under Top 10 Teams  311477.661212  164251.849252  170119.644722  308852.455285

In [148]:
Merged_Dataset_Pivot.mean(axis = 1)

Top 10 Teams          349597.768354
Under Top 10 Teams    238675.402618
dtype: float64

In [149]:
print("Higher-performing clubs tend to pay their players more than the lower-performing clubs")

Higher-performing clubs tend to pay their players more than the lower-performing clubs